In [1]:
#import library
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
#load dataset
df_customer = pd.read_csv('../dataset/customer.csv')
df_customer.head()

   CustomerID  Age  Gender Marital Status Income
0           1   55       1        Married   5,12
1           2   60       1        Married   6,23
2           3   32       1        Married   9,17
3           4   31       1        Married   4,87
4           5   58       1        Married   3,57

In [11]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 447 entries, 0 to 446
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CustomerID      447 non-null    int64
 1   Age             447 non-null    int64
 2   Gender          447 non-null    int64
 3   Marital Status  444 non-null    object
 4   Income          447 non-null    object
dtypes: int64(3), object(2)
memory usage: 17.6+ KB

In [10]:
df_customer.isnull().sum()

CustomerID        0
Age               0
Gender            0
Marital Status    3
Income            0
dtype: int64

In [14]:
#fill null value with modus
df_customer['Marital Status'] = df_customer['Marital Status'].fillna(df_customer['Marital Status'].mode()[0])
df_customer.isnull().sum()

CustomerID        0
Age               0
Gender            0
Marital Status    0
Income            0
dtype: int64

In [15]:
df_customer.describe().T

            count        mean         std  min    25%    50%    75%    max
CustomerID  447.0  224.000000  129.182042  1.0  112.5  224.0  335.5  447.0
Age         447.0   39.782998   12.848719  0.0   30.0   39.0   50.5   72.0
Gender      447.0    0.458613    0.498842  0.0    0.0    0.0    1.0    1.0

In [4]:
df_product = pd.read_csv('../dataset/product.csv')
df_product.head()

  ProductID  Product Name  Price
0        P1     Choco Bar   8800
1        P2  Ginger Candy   3200
2        P3      Crackers   7500
3        P4   Potato Chip  12000
4        P5      Thai Tea   4200

In [16]:
df_product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ProductID     10 non-null     object
 1   Product Name  10 non-null     object
 2   Price         10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [19]:
df_product.isnull().sum()

ProductID       0
Product Name    0
Price           0
dtype: int64

In [20]:
df_product.describe().T

       count     mean          std     min     25%     50%      75%      max
Price   10.0  10410.0  4890.455557  3200.0  7825.0  9700.0  14250.0  18000.0

In [5]:
df_store = pd.read_csv('../dataset/store.csv')
df_store.head()

   StoreID         StoreName GroupStore           Type   Latitude   Longitude
0        1     Prima Tendean      Prima   Modern Trade       -6,2  106,816666
1        2  Prima Kelapa Dua      Prima   Modern Trade  -6,914864  107,608238
2        3        Prima Kota      Prima   Modern Trade  -7,797068  110,370529
3        4       Gita Ginara       Gita  General Trade  -6,966667  110,416664
4        5           Bonafid       Gita  General Trade  -7,250445  112,768845

In [21]:
df_store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   StoreID     14 non-null     int64
 1   StoreName   14 non-null     object
 2   GroupStore  14 non-null     object
 3   Type        14 non-null     object
 4   Latitude    14 non-null     object
 5   Longitude   14 non-null     object
dtypes: int64(1), object(5)
memory usage: 804.0+ bytes

In [22]:
df_store.isnull().sum()

StoreID       0
StoreName     0
GroupStore    0
Type          0
Latitude      0
Longitude     0
dtype: int64

In [23]:
df_store.describe().T

         count  mean     std  min   25%  50%    75%   max
StoreID   14.0   7.5  4.1833  1.0  4.25  7.5  10.75  14.0

In [6]:
df_transaction = pd.read_csv('../dataset/transaction.csv')
df_transaction.head()

,TransactionID,CustomerID,Date,ProductID,Price,Qty,TotalAmount,StoreID
0,TR11369,328,01/01/2022,P3,7500,4,30000,12
1,TR16356,165,01/01/2022,P9,10000,7,70000,1
2,TR1984,183,01/01/2022,P1,8800,4,35200,4
3,TR35256,160,01/01/2022,P1,8800,7,61600,4
4,TR41231,386,01/01/2022,P9,10000,1,10000,4

In [24]:
df_transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5020 entries, 0 to 5019
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   TransactionID  5020 non-null   object
 1   CustomerID     5020 non-null   int64
 2   Date           5020 non-null   object
 3   ProductID      5020 non-null   object
 4   Price          5020 non-null   int64
 5   Qty            5020 non-null   int64
 6   TotalAmount    5020 non-null   int64
 7   StoreID        5020 non-null   int64
dtypes: int64(5), object(3)
memory usage: 313.9+ KB

In [25]:
df_transaction.isnull().sum()

TransactionID    0
CustomerID       0
Date             0
ProductID        0
Price            0
Qty              0
TotalAmount      0
StoreID          0
dtype: int64

In [26]:
df_transaction.describe().T

,count,mean,std,min,25%,50%,75%,max
CustomerID,5020.0,221.263745,129.672955,1.0,108.0,221.0,332.0,447.0
Price,5020.0,9684.800797,4600.708780,3200.0,4200.0,9400.0,15000.0,18000.0
Qty,5020.0,3.644622,1.855295,1.0,2.0,3.0,5.0,10.0
TotalAmount,5020.0,32279.482072,19675.462455,7500.0,16000.0,28200.0,47000.0,88000.0
StoreID,5020.0,7.489841,4.028502,1.0,4.0,7.0,11.0,14.0

In [28]:
df = pd.concat([df_customer, df_store, df_product, df_transaction], axis=0,ignore_index=True)
df.head()

,CustomerID,Age,Gender,Marital Status,Income,StoreID,StoreName,GroupStore,Type,Latitude,Longitude,ProductID,Product Name,Price,TransactionID,Date,Qty,TotalAmount
0,1.0,55.0,1.0,Married,"5,12",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,60.0,1.0,Married,"6,23",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,32.0,1.0,Married,"9,17",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,31.0,1.0,Married,"4,87",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,58.0,1.0,Married,"3,57",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5491 entries, 0 to 5490
Data columns (total 18 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CustomerID      5467 non-null   float64
 1   Age             447 non-null    float64
 2   Gender          447 non-null    float64
 3   Marital Status  447 non-null    object
 4   Income          447 non-null    object
 5   StoreID         5034 non-null   float64
 6   StoreName       14 non-null     object
 7   GroupStore      14 non-null     object
 8   Type            14 non-null     object
 9   Latitude        14 non-null     object
 10  Longitude       14 non-null     object
 11  ProductID       5030 non-null   object
 12  Product Name    10 non-null     object
 13  Price           5030 non-null   float64
 14  TransactionID   5020 non-null   object
 15  Date            5020 non-null   object
 16  Qty             5020 non-null   float64
 17  TotalAmount     5020 non-null   float64
dtypes: float64(7), object(11)
memory usage: 772.3+ KB